# 서울시 구별 CCTV 현황

## 엑셀 파일 읽기

In [1]:
import pandas as pd

In [3]:
CCTV_Seoul = pd.read_csv('01. CCTV_in_Seoul.csv', encoding = 'utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [5]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [6]:
CCTV_Seoul.columns[0]

'기관명'

In [8]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'}, inplace = True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [15]:
pop_Seoul = pd.read_excel('01. population_in_Seoul.xls',
                          header=2, #3번째 줄부터 읽으라는 명령
                          parse_cols='B,D,G,J,N',  #B,D,G,J,N열만 읽겠다는 의미 
                          encoding='utf-8')
pop_Seoul.head()

C:\Users\jck30\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: the 'parse_cols' keyword is deprecated, use 'usecols' instead
  after removing the cwd from sys.path.

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [19]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]:'구별',
                          pop_Seoul.columns[1]:'인구수',
                          pop_Seoul.columns[2]:'한국인',
                          pop_Seoul.columns[3]:'외국인',
                          pop_Seoul.columns[4]:'고령자'} , inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

## pandas 기초 익히기

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6) #date_range : 날짜형 데이터
dates                                          #periods=6 :6일간

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df                      #6행 4열의 random변수

                   A         B         C         D
2013-01-01 -2.278135  0.720620  1.543596  0.584311
2013-01-02 -0.141034  1.645856 -0.099490  0.165537
2013-01-03  0.064144 -0.315969 -1.377351  0.938402
2013-01-04 -0.678227 -0.544817 -0.925588 -1.346943
2013-01-05 -1.149632  0.849862  0.244206  0.512092
2013-01-06  0.228983 -0.257428  1.179397 -0.518909

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [10]:
df.values

array([[-2.27813518,  0.72061976,  1.54359587,  0.58431085],
       [-0.14103436,  1.64585631, -0.09948974,  0.1655367 ],
       [ 0.0641443 , -0.31596863, -1.37735065,  0.93840213],
       [-0.67822664, -0.54481699, -0.92558789, -1.3469433 ],
       [-1.14963197,  0.84986228,  0.24420571,  0.51209244],
       [ 0.22898282, -0.25742802,  1.1793973 , -0.51890911]])

In [12]:
df.info()  #데이터 프레임의 개요

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [13]:
df.describe() #통계적 개요

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.658984  0.349687  0.094128  0.055748
std    0.942595  0.857863  1.144015  0.845758
min   -2.278135 -0.544817 -1.377351 -1.346943
25%   -1.031781 -0.301333 -0.719063 -0.347798
50%   -0.409631  0.231596  0.072358  0.338815
75%    0.012850  0.817552  0.945599  0.566256
max    0.228983  1.645856  1.543596  0.938402

In [16]:
df.sort_values(by='B', ascending=False)
#by로 지정된 컬럼 기준으로 정렬, ascending으로 오름차순/ 내림차순 판단

                   A         B         C         D
2013-01-02 -0.141034  1.645856 -0.099490  0.165537
2013-01-05 -1.149632  0.849862  0.244206  0.512092
2013-01-01 -2.278135  0.720620  1.543596  0.584311
2013-01-06  0.228983 -0.257428  1.179397 -0.518909
2013-01-03  0.064144 -0.315969 -1.377351  0.938402
2013-01-04 -0.678227 -0.544817 -0.925588 -1.346943

In [17]:
df

                   A         B         C         D
2013-01-01 -2.278135  0.720620  1.543596  0.584311
2013-01-02 -0.141034  1.645856 -0.099490  0.165537
2013-01-03  0.064144 -0.315969 -1.377351  0.938402
2013-01-04 -0.678227 -0.544817 -0.925588 -1.346943
2013-01-05 -1.149632  0.849862  0.244206  0.512092
2013-01-06  0.228983 -0.257428  1.179397 -0.518909

In [21]:
df['A']   #Series로 보여줌

2013-01-01   -2.278135
2013-01-02   -0.141034
2013-01-03    0.064144
2013-01-04   -0.678227
2013-01-05   -1.149632
2013-01-06    0.228983
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]  #0행부터 2행까지

                   A         B         C         D
2013-01-01 -2.278135  0.720620  1.543596  0.584311
2013-01-02 -0.141034  1.645856 -0.099490  0.165537
2013-01-03  0.064144 -0.315969 -1.377351  0.938402